manuals = [
{ title: '『ブランドを知ろう』', content: 'ブランドとは企業や製品、サービスが持つ独自の価値や個性を表現する総合的な概念です。
    自社のHPや資料を通じてブランドコンセプトを知りましょう。（先輩社員が直接資料を元に伝えるように）

    ① ブランドが生まれた背景とは？
    ・ブランドが誕生するまでの経緯を知りましょう。

    ② ブランド名にはどのような意味がこめられていのか？
    ・ブランド名に込められた意味やメッセージ、由来を理解しましょう。

    ③ ブランドが何を大切にし、今後どこへ向かっているのか？
    ・ブランドのミッション、ビジョン、そして将来の目標を知りましょう。

    ④ ブランドのターゲット層はどこなのか？
    ・ブランドが対象としている顧客層や市場セグメントを把握しましょう。

    ⑤ ブランドの製品ラインアップと特徴は？
    ・主力製品やサービス、その特徴や強みを理解しましょう。

    これらのポイントを押さえてブランドコンセプトを理解することで、
    他ブランドとの違いを理解でき、お客様に自社ブランドの価値を提供できます。', category: '1. ブランドを知ろう' },

{ title: '『試着会をしよう』', content: '試着会は、商品に対する理解を深めるためにとても大切な機会です。
    入社説明後早めの段階で行いましょう!必ず先輩スタッフと2人1組で行い、商品説明を行いながら試着しましょう。
    その際に新人スタッフは試着したお洋服の感想を伝えてみてください。

    ①実際に着用することでの理解
    ・商品のフィット感、素材の感触、動きやすさなど、実際に試着しないとわからない要素を体験できます。

    ②商品の特徴を把握
    ・それぞれの商品が持つ特徴やデザインのポイント、他の商品との違いを具体的に把握することができます。

    ③顧客の気持ちを理解
    ・試着を通じて、顧客が感じることや気にするポイントを実感することで、より親身な接客が可能になります。

    ④フィッティングアドバイスの向上
    ・顧客に対して的確なフィッティングアドバイスを行うためには、自分自身の体験が重要です。

    ⑤実際の商品説明
    ・試着中に先輩スタッフが商品の説明を行うことで、接客トークの練習になります。

    以上のポイントを意識して試着会を行うことで、商品知識の習得や接客スキルの向上など学びを深めることができます。',
    category: '2. 試着会をしよう' },

{ title: '『基本的な敬語を知ろう』', content: 'アパレル業界で敬語を適切に使うことは、顧客との信頼関係を築き、満足度を高めるために不可欠です。基本的な敬語は接客に入る前に覚えておきましょう。

「使用頻度が高い敬語」
いらっしゃいませ。かしこまりました。少々お待ちくださいませ。お待たせいたしました。恐れ入ります。申し訳ございません。ありがとうございます。

「丁寧な表現」
～でございます（例：こちらの商品でございます）。～いたします（例：お包みいたします）。少々お待ちくださいませ。

「提案」
こちらはいかがでしょうか？ お試しになられますか？ こちらの商品もおすすめでございます.

「案内」
こちらへどうぞ。ご案内いたします。こちらにございます。

「質問」
何かお探しでしょうか？ ご希望の商品はございますか？ サイズはいかがいたしましょうか？

「確認」
よろしいでしょうか？ お間違いございませんか？ ご確認お願いいたします。

「感謝」
ご来店いただき、ありがとうございます。またお越しくださいませ。

「お詫び」
申し訳ございません。お待たせして申し訳ございません。ご迷惑をおかけいたしまして、申し訳ございません。',
category: '3. 基本的な敬語を知ろう' },

{ title: '『素材を知ろう』', content: '素材に関する知識を深めることでお客様に対して適切なアドバイスを提供することができます。
ブランドにより素材の特性もありますが、一般的な基本の素材をまずは覚えましょう。

①天然素材: 綿、麻、ウール、シルクなど ②合成素材: ポリエステル、ポリウレタン、ナイロン、アクリルなど ③再生繊維: レーヨン、テンセルなど

「メリット・デメリット」

『綿』 通気性が良く、吸湿性が高い。熱に強くて丈夫。縮みやすく、シワになりやすい。
『麻』 通気性が良く、水分の吸湿や発散性に優れているため、清涼感がある。シワになりやすく、摩擦で毛羽立ちやすい。
『ウール』 保温性が高く、伸縮性に優れ弾力性がある。虫がつきやすく、毛玉ができやすい。縮みやすい。
『シルク』 美しく光沢がある。保温性、保湿性、発散性に優れている。シミになりやすく、酸やアルカリに弱い。水に濡れると縮みやすい。
『ポリエステル』 耐久性があり、しわになりにくい。丈夫で乾きが早い。吸湿性が低く、静電気が起きやすい。
『ポリウレタン』 弾力性があり、摩擦に強く、耐久性がある。柔らかく着心地が良い。高温に弱く、熱で劣化しやすい。水を吸収しにくい。
『ナイロン』 引っ張りや摩擦に強く、耐久性がある。軽い素材で、動きやすい。静電気が起きやすく、汗をかいても吸収しにくく、蒸れやすい。
『アクリル』保温性が高く、しわになりにくい。汗をかいても吸収しにくく、蒸れやすい。毛玉ができやすい。
『レーヨン』シルクに似た光沢と手触りが特徴。汗を吸収しやすく、快適な着心地。摩擦や引っ張りに弱く、破れやすい。選択で縮むことがある。
『テンセル』 持続可能な木材から作られ、生分解性がある。吸湿性が高く滑らかな手触り。縮みやすく、シワになりやすい。',
category: '4. 素材を知ろう' },

{ title: '接客の基本①', content: 'ついに接客編です！基本を学び接客のプロを目指しましょう！ますは、ゼロ印象を学んでいきましょう。

「ゼロ印象とは？」
お客様がスタッフと初めて接触する前のスタッフの印象のことを指します。
可愛いお洋服があるからこのお店見たいな。とお客様が思ったとき、店頭のスタッフがどんな行動をしていると印象が良いと感じて、実際にお店に入ってみようと思いますか？

①怖い顔でスマホをいじりながら、ぼーっと立っている。
②常に動きまわり、自然な笑顔でたっている。

どうでしょうか？もちろん②のスタッフの印象の方が良いですよね。
どんなにお洋服が可愛くても①のような行動をするスタッフだとお店に入りずらいですし、入りたくないと感じませんか？
お客様は自分が感じている以上にスタッフの行動を見ています。お客様が入店してからではなく、入店する前から接客をする準備をしておきましょう。

「実際にゼロ印象で行う行動」
・自然な笑顔で立つ（お客様が近づくときに、明るく笑顔で迎える準備をしましょう）
・清潔感のある服装と整った髪型。（服がしわだらけで髪が乱れているスタッフからお洋服を買いたいとは思えませんよね）
・丁寧に商品を整理し、店内を整頓する（笑顔でも立っているだけだと接客を警戒されてしまいます。整理するのはもちろんですが、接客を警戒されない為にも意識して動きましょう。）

ゼロ印象を学び、お客様が入店しやすいお店づくりを一緒にしましょう！',
category: '5. 接客の基本①' },

{ title: '接客の基本②', content: 'ウェルカムアプローチを学びましょう。

「ウェルカムアプローチとは？」
お客様が店舗に入店した直後に行う最初の対応を指します。
このアプローチは、お客様に歓迎の意を示し、店舗に入ったことを認識してもらうためのものです。

「目的」
歓迎の意を示す: お客様に店舗に入店してもらったことを歓迎します。
第一印象を良くする: お店の雰囲気を感じてもらい、心地よいスタートを切ってもらいましょう。

「主な行動」
笑顔での挨拶: 「いらっしゃいませ」と明るく笑顔で声をかけてみましょう。
軽い会話: 「新作揃っていますので、ぜひごゆっくりご覧になってくださいね」など短くても興味を持つワードをいれてみましょう。
→ごゆっくりご覧になってください。よりも新作揃ってますので〜、本日新作日で〜、再入荷アイテムもありますので〜。
などのワードを加えるだけで、お客様に興味を持ってもらいやすく「じゃあ店内ゆっくり見てみよう！」という心理が働くものです。

ぜひ接客を通じて、ワードの引き出しを増やしてみてくださいね。',

category: '6. 接客の基本②' },
]

manuals.each do |manual_attributes|
    manual = Manual.find_or_initialize_by(title: manual_attributes[:title], category: manual_attributes[:category])
    manual.content = manual_attributes[:content]
    manual.save
end


# This file should ensure the existence of records required to run the application in every environment (production,
# development, test). The code here should be idempotent so that it can be executed at any point in every environment.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Example:
#
#   ["Action", "Comedy", "Drama", "Horror"].each do |genre_name|
#     MovieGenre.find_or_create_by!(name: genre_name)
#   end
